* 
:properties:
:author: Dr. T.T. Mirnalinee  and Dr. K. Lekshmi
:date: 21/07/2021
:end:

{{{title-tab}}}
| CODE    | COURSE TITLE   | L | T | P | E | C |
| UCS2724 | SOFT COMPUTING | 3 | 0 | 0 | 0 | 3 |


** COURSE OBJECTIVES
- To introduce the ideas of fuzzy sets and fuzzy logic 
- To study the characteristics of various types of neural networks
- To provide  the  mathematical  background  for  carrying  out  the  optimization  associated  with neural network learning and genetic algorithms
- To gain insight in Hybrid Learning Models

#+startup: showall

{{{unit}}}
|UNIT I | FUZZY LOGIC | 10 |
Introduction to Neuro-Fuzzy and Soft Computing; Fuzzy Sets : Basic
Definition and Terminology -- Set-theoretic Operations -- Member
Function Formulation and Parameterization -- Fuzzy Rules and Fuzzy
Reasoning -- Extension Principle and Fuzzy Relations -- Fuzzy If-Then
Rules -- Fuzzy Reasoning -- Fuzzy Inference Systems -- Mamdani Fuzzy
Models -- Sugeno Fuzzy Models --Tsukamoto Fuzzy Models -- Input Space
Partitioning and Fuzzy Modeling

{{{unit}}}
|UNIT II | NEURAL NETWORKS | 7 | 
Supervised Learning Neural Networks: Perceptrons –- Adaline –-
Backpropagation Mutilayer Perceptrons –- Radial Basis Function
Networks; Unsupervised Learning NeuralNetworks: Competitive Learning
Networks –- Kohonen Self-Organizing Networks -– Learning Vector
Quantization –- Hebbian Learning

{{{unit}}}
|UNIT III | CONVENTIONAL OPTIMIZATION  | 9 |
Derivative-based Optimization: Descent Methods -- The Method of
Steepest Descent -- Classical Newton's Method -- Step Size
Determination -- Conjugate gradient Methods -- Analysis of Quadratic 
Case

{{{unit}}}
|UNIT IV | GENETIC ALGORITHMS | 10 |
Genetic Algorithms: Genetic algorithm and search space -- general
genetic algorithm –- operators -- Generational cycle -- stopping
condition –- constraints –- classification; Simulated Annealing --
Random Search -- Downhill Simplex Search -- Particle Swarm
Optimization -- Ant Colony Optimization.

{{{unit}}}
|UNIT V | NEURO FUZZY MODELING | 9 |
Adaptive Neuro-Fuzzy Inference Systems: Architecture –- Hybrid
Learning Algorithm –- Learning Methods that Cross-fertilize ANFIS and
RBFN; Coactive Neuro Fuzzy Modeling: Framework Neuron Functions for
Adaptive Networks –- Neuro Fuzzy Spectrum.


\hfill *Total Periods: 45*

** COURSE OUTCOMES
After the completion of this course, students will be able to 

   
1.   Apply fuzzy logic for solving real world problems (K3)
2.   Demonstrate the use of neural networks in solving computational problems (K2)
3.   Apply derivative based optimization techniques on computational problems (K3)
4.   Explain genetic algorithms and evolutionary optimization (K2)
5.   Analyse and compare neuro-fuzzy hybrid models (K4)

 
** TEXT BOOKS
1. J S R Jang, C T Sun, E Mizutani, ``Neuro-Fuzzy and Soft
   Computing'', PHI / Pearson Education 2004.

** REFERENCES
1. S Rajasekaran, G A Vijayalakshmi Pai, ``Neural Networks, Fuzzy
   Logic and Genetic Algorithm: Synthesis & Applications'',
   Prentice-Hall of India Pvt. Ltd., 2006.
2. Timothy J Ross, ``Fuzzy Logic with Engineering Applications'',
   McGraw-Hill, International Editions, Electrical Engineering Series,
   Singapore, 1997.
3. Davis E Goldberg, ``Genetic Algorithms: Search, Optimization and
   Machine Learning'', Addison Wesley, N.Y., 1989.
4. Samir Roy, ``Introduction to Softcomputing : NeuroFuzzy and Genetic Algorithms'', First edition, Pearson Publishers, 2015.
5. R Eberhart, P Simpson, R Dobbins, ``Computational Intelligence - PC
   Tools'', AP Professional, Boston. 1996.
6. Stamatios V Kartalopoulos, ``Understanding Neural Networks and
   Fuzzy Logic Basic concepts & Applications'', IEEE Press, PHI, New
   Delhi, 2004.
7. Vojislav Keeman, ``Learning & Soft Computing Support Vector
   Machines, Neural Networks, and Fuzzy Logic Models'', Pearson
   Education, New Delhi, 2006.

#+begin_comment
** LIST OF PROJECTS
1. Intelligent fuzzy based washing time prediction with parameter
   dependency.
2. Ant Colony Optimization to search best route in Travelling Sales Person Problem.
3. Ant Colony Optimization approach for edge detection in image.
4. Artficial Neural Network(ANN) Design for different Coin Recognition
   System.
5. Artificial Intelligence Based Fuzzified Anti Lock Breaking
   System(ABS) for smart vehicle.
6. Fuzzy system designing for detection of edge in image.
7. Any type of Cancer risk classification.
8. Fuzzy Logic in washing machine.
9. Artficial Intelligence based facial recognition software for social
   media “Facebook”.
10. Artificial Neural Networks in Cryptography(Hint: Simple Recurrent
    structure like Jordan Network, trained by the back-propagation
    algorithm).
11. Automatic text summarization (Hint: Apply deep neural networks).
12. Human activity recognition (Hint: implement a neural network-based
    model to detect human activities – for example, sitting on a
    chair, falling, picking something up, opening or closing a door,
    etc. This is a video classification project, which will include
    combining a series of images and classifying the action.)
#+end_comment

** CO TO PO/PSO MAPPING

| PO/PSO | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 | 11 | 12 | 1 | 2 | 3 |
|--------+---+---+---+---+---+---+---+---+---+----+----+----+---+---+---|
| CO1    | 3 | 2 |   |   |   |   |   |   |   |    |    |    | 3 |   |   |
| CO2    | 3 | 2 |   |   |   |   |   |   |   |    |    |    | 3 |   |   |
| CO3    | 3 |   |   |   |   |   |   |   |   |    |    |    | 1 |   |   |
| CO4    | 3 | 2 |   |   |   |   |   |   |   |    |    |    | 3 |   |   |
| CO5    | 3 | 2 | 3 |   | 2 |   |   |   | 3 | 3  |    |  3 | 3 |   |   |
|--------+---+---+---+---+---+---+---+---+---+----+----+----+---+---+---|
| Course | 3 | 2 | 3 |   | 2 |   |   |   | 3 | 3  |    |  3 | 3 |   |   |
#+TBLFM: @>$INVALID..$15='(ceiling (/ (+ @2..@7) 6));N

# | Score|15 | 8 | 3 |   | 2 |   |   |   | 3 |  3 |    |  3 | 13|   |   |
